pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxPms_bf.h
/** \brief Length for Ifx_PMS_EVRSDCOEFF0_Bits.M0S3CLIP */
#define IFX_PMS_EVRSDCOEFF0_M0S3CLIP_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF0_Bits.M0S3CLIP */
#define IFX_PMS_EVRSDCOEFF0_M0S3CLIP_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF0_Bits.M0S3CLIP */
#define IFX_PMS_EVRSDCOEFF0_M0S3CLIP_OFF (3u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF0_Bits.M0S4EN */
#define IFX_PMS_EVRSDCOEFF0_M0S4EN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF0_Bits.M0S4EN */
#define IFX_PMS_EVRSDCOEFF0_M0S4EN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF0_Bits.M0S4EN */
#define IFX_PMS_EVRSDCOEFF0_M0S4EN_OFF (4u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF0_Bits.M0RAMPEN */
#define IFX_PMS_EVRSDCOEFF0_M0RAMPEN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF0_Bits.M0RAMPEN */
#define IFX_PMS_EVRSDCOEFF0_M0RAMPEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF0_Bits.M0RAMPEN */
#define IFX_PMS_EVRSDCOEFF0_M0RAMPEN_OFF (5u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF0_Bits.M0SFRGET */
#define IFX_PMS_EVRSDCOEFF0_M0SFRGET_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF0_Bits.M0SFRGET */
#define IFX_PMS_EVRSDCOEFF0_M0SFRGET_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF0_Bits.M0SFRGET */
#define IFX_PMS_EVRSDCOEFF0_M0SFRGET_OFF (6u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF0_Bits.M0SKIPEN */
#define IFX_PMS_EVRSDCOEFF0_M0SKIPEN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF0_Bits.M0SKIPEN */
#define IFX_PMS_EVRSDCOEFF0_M0SKIPEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF0_Bits.M0SKIPEN */
#define IFX_PMS_EVRSDCOEFF0_M0SKIPEN_OFF (7u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF0_Bits.M0S3COEFF */
#define IFX_PMS_EVRSDCOEFF0_M0S3COEFF_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF0_Bits.M0S3COEFF */
#define IFX_PMS_EVRSDCOEFF0_M0S3COEFF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF0_Bits.M0S3COEFF */
#define IFX_PMS_EVRSDCOEFF0_M0S3COEFF_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF0_Bits.M0S4COEFF */
#define IFX_PMS_EVRSDCOEFF0_M0S4COEFF_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF0_Bits.M0S4COEFF */
#define IFX_PMS_EVRSDCOEFF0_M0S4COEFF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF0_Bits.M0S4COEFF */
#define IFX_PMS_EVRSDCOEFF0_M0S4COEFF_OFF (12u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF0_Bits.M0SRMPCOEFF */
#define IFX_PMS_EVRSDCOEFF0_M0SRMPCOEFF_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF0_Bits.M0SRMPCOEFF */
#define IFX_PMS_EVRSDCOEFF0_M0SRMPCOEFF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF0_Bits.M0SRMPCOEFF */
#define IFX_PMS_EVRSDCOEFF0_M0SRMPCOEFF_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF0_Bits.M0FGETCOEFF */
#define IFX_PMS_EVRSDCOEFF0_M0FGETCOEFF_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF0_Bits.M0FGETCOEFF */
#define IFX_PMS_EVRSDCOEFF0_M0FGETCOEFF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF0_Bits.M0FGETCOEFF */
#define IFX_PMS_EVRSDCOEFF0_M0FGETCOEFF_OFF (20u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF0_Bits.M0S2COEFF */
#define IFX_PMS_EVRSDCOEFF0_M0S2COEFF_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF0_Bits.M0S2COEFF */
#define IFX_PMS_EVRSDCOEFF0_M0S2COEFF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF0_Bits.M0S2COEFF */
#define IFX_PMS_EVRSDCOEFF0_M0S2COEFF_OFF (24u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF0_Bits.M0S2VINSRC */
#define IFX_PMS_EVRSDCOEFF0_M0S2VINSRC_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF0_Bits.M0S2VINSRC */
#define IFX_PMS_EVRSDCOEFF0_M0S2VINSRC_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF0_Bits.M0S2VINSRC */
#define IFX_PMS_EVRSDCOEFF0_M0S2VINSRC_OFF (28u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF0_Bits.M0S2VOSRC */
#define IFX_PMS_EVRSDCOEFF0_M0S2VOSRC_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF0_Bits.M0S2VOSRC */
#define IFX_PMS_EVRSDCOEFF0_M0S2VOSRC_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF0_Bits.M0S2VOSRC */
#define IFX_PMS_EVRSDCOEFF0_M0S2VOSRC_OFF (29u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF0_Bits.M0SRMPCOEFFFRAC */
#define IFX_PMS_EVRSDCOEFF0_M0SRMPCOEFFFRAC_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF0_Bits.M0SRMPCOEFFFRAC */
#define IFX_PMS_EVRSDCOEFF0_M0SRMPCOEFFFRAC_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF0_Bits.M0SRMPCOEFFFRAC */
#define IFX_PMS_EVRSDCOEFF0_M0SRMPCOEFFFRAC_OFF (30u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF0_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF0_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF0_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF0_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF0_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF0_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF1_Bits.M0VOCFLPF */
#define IFX_PMS_EVRSDCOEFF1_M0VOCFLPF_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF1_Bits.M0VOCFLPF */
#define IFX_PMS_EVRSDCOEFF1_M0VOCFLPF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF1_Bits.M0VOCFLPF */
#define IFX_PMS_EVRSDCOEFF1_M0VOCFLPF_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF1_Bits.M0VOCFINC */
#define IFX_PMS_EVRSDCOEFF1_M0VOCFINC_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF1_Bits.M0VOCFINC */
#define IFX_PMS_EVRSDCOEFF1_M0VOCFINC_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF1_Bits.M0VOCFINC */
#define IFX_PMS_EVRSDCOEFF1_M0VOCFINC_OFF (4u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF1_Bits.M0VOUT */
#define IFX_PMS_EVRSDCOEFF1_M0VOUT_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF1_Bits.M0VOUT */
#define IFX_PMS_EVRSDCOEFF1_M0VOUT_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF1_Bits.M0VOUT */
#define IFX_PMS_EVRSDCOEFF1_M0VOUT_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF1_Bits.M0VIN */
#define IFX_PMS_EVRSDCOEFF1_M0VIN_LEN (11u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF1_Bits.M0VIN */
#define IFX_PMS_EVRSDCOEFF1_M0VIN_MSK (0x7ffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF1_Bits.M0VIN */
#define IFX_PMS_EVRSDCOEFF1_M0VIN_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF1_Bits.M0S3COEFFFRAC */
#define IFX_PMS_EVRSDCOEFF1_M0S3COEFFFRAC_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF1_Bits.M0S3COEFFFRAC */
#define IFX_PMS_EVRSDCOEFF1_M0S3COEFFFRAC_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF1_Bits.M0S3COEFFFRAC */
#define IFX_PMS_EVRSDCOEFF1_M0S3COEFFFRAC_OFF (27u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF1_Bits.M0S2COEFFFRAC */
#define IFX_PMS_EVRSDCOEFF1_M0S2COEFFFRAC_LEN (2u)

